/* Типы итоговых */
INSERT INTO ITOG_TYPE (T_ID, SHORT_TITLE, TYPE_NAME, IN_YEAR_COUNT,  SORT_NUM) VALUES
(1,'год','Учебный Год',1,4),
(2,'сем','Полугодие',2,3),
(3,'трм','Триместр',3,2),
(4,'чтв','Четверть',4,1),
(5,'экз','Экзамен',0,5),
(6,'итог','Итоговая отметка',0,6);

/* Пресеты итоговых отметок */
INSERT INTO ITOG_PRESET (PR_ID,PRESET_GROUP,MARK_TITLE,VALUE_STATE,SUCCESS_VALUE) VALUES 
 (0,1,'осв',0,NULL),
 (1,1,'н/а',1,'0.00'),
 (2,1,'2',1,'0.30'),
 (3,1,'3',2,'0.60'),
 (4,1,'4',3,'0.80'),
 (5,1,'5',3,'1.00'),
 (6,2,'зачёт',3,'1.00'),
 (7,2,'незач',1,'0.00'),
 (8,3,'%',2,'0.50'),
 (9,3,'%',3,'0.70');
 